Revit 2027 API
ParameterTypeId.UserLevelConstraint Property
 "Base Constraint"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId UserLevelConstraint { get; }
Public Shared ReadOnly Property UserLevelConstraint As ForgeTypeId
	Get
public:
static property ForgeTypeId^ UserLevelConstraint {
	ForgeTypeId^ get ();
}
static member UserLevelConstraint : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace